tap "teamookla/speedtest"
tap "yakitrak/yakitrak"

# --- CLI tools ---
brew "bash"                                    # Newer Bash (macOS ships an old version)
brew "curl"                                    # HTTP transfer tool
brew "docker"                                  # Container platform CLI
brew "emacs"                                   # Text editor
brew "exiftool"                                # Read/edit metadata in photos and files
brew "gemini-cli"                              # Google Gemini AI in the terminal
brew "gh"                                      # GitHub CLI — repos, PRs, issues
brew "git-filter-repo"                         # Rewrite git history
brew "glances"                                 # System monitor (CPU, memory, network)
brew "htop"                                    # Interactive process monitor
brew "httpie"                                  # Friendly HTTP client CLI
brew "libmagic"                                # File type detection library
brew "libzip"                                  # Zip file library
brew "mas"                                     # Mac App Store CLI (used by this Brewfile)
brew "node"                                    # Node.js runtime
brew "php"                                     # PHP runtime
brew "pipx"                                    # Install Python CLI apps in isolation
brew "python3"                                 # Python (latest stable)
brew "rsync"                                   # Fast file sync over SSH or local
brew "tree"                                    # Show directory structure as a tree
brew "wget"                                    # Download files from the web
brew "teamookla/speedtest/speedtest"           # Ookla Speedtest CLI
brew "yakitrak/yakitrak/obsidian-cli"          # Control Obsidian from the terminal

# --- GUI apps (casks) ---
cask "1password"                               # Password manager
cask "1password-cli"                           # 1Password command-line tool
cask "claude"                                  # Anthropic Claude desktop app
cask "docker"                                  # Docker Desktop
cask "dropbox"                                 # Cloud file sync
cask "garmin-express"                          # Sync and update Garmin devices
cask "google-chrome"                           # Web browser
cask "iterm2"                                  # Terminal emulator
cask "obsidian"                                # Note-taking and knowledge base
cask "postman"                                 # API testing and development
cask "slack"                                   # Team messaging
cask "spotify"                                 # Music streaming
cask "synology-drive"                          # Sync files with Synology NAS
cask "tailscale"                               # VPN between your devices
cask "transmit"                                # FTP/SFTP/S3 file transfer
cask "visual-studio-code"                      # Code editor

# --- App Store apps (requires: brew "mas") ---
mas "1Password for Safari",          id: 1569813296  # Safari extension for 1Password
mas "Deliveries",                    id: 290986013   # Package tracking
mas "Double Shot",                   id: 1076145960  # Menu bar coffee/caffeine timer
mas "Keynote",                       id: 361285480   # Presentations
mas "Numbers",                       id: 361304891   # Spreadsheets
mas "Pages",                         id: 361309726   # Word processor
mas "reMarkable",                    id: 1276493162  # Companion app for reMarkable tablet
mas "Simple Refresh",                id: 1492951704  # Auto-refresh browser tabs
mas "Things 3",                      id: 904280696   # Task manager
mas "ViaTrumfBonusvarsler",          id: 1482280932  # Ruter bonus notifications
mas "Wipr",                          id: 1662217862  # Ad blocker for Safari
mas "Xcode",                         id: 497799835   # Apple IDE (also installs dev tools)

# --- Manual installs (not available via brew or App Store) ---
# - Monitor Center
# - myAudi
# - PhoneExpander
# - Recording
# - Reolink
# - Synology Surveillance Station Client
# - Zaptec

uv "nano-pdf"                                  # PDF tools
