tap "openhue/cli"
tap "steipete/tap"
tap "teamookla/speedtest"
tap "yakitrak/yakitrak"
brew "zstd"
brew "libtiff"
brew "little-cms2"
brew "jpeg-xl"
brew "webp"
brew "aom"
brew "aria2"
brew "bash"
brew "curl"
brew "python@3.13"
brew "czkawka"
brew "docker"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "python@3.14"
brew "evernote-backup"
brew "exiftool"
brew "freetds"
brew "libavif"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git-filter-repo"
brew "glances"
brew "go"
brew "libdvdcss"
brew "handbrake"
brew "htop"
brew "httpie"
brew "libmagic"
brew "libpq"
brew "libzip"
brew "ncftp"
brew "nmap"
brew "php"
brew "pipx"
brew "poppler"
brew "rsync"
brew "testdisk"
brew "tree"
brew "wget"
brew "xorriso"
brew "openhue/cli/openhue-cli"
brew "steipete/tap/gogcli"
brew "steipete/tap/goplaces"
brew "steipete/tap/imsg"
brew "steipete/tap/peekaboo"
brew "steipete/tap/songsee"
brew "steipete/tap/summarize"
brew "teamookla/speedtest/speedtest"
brew "yakitrak/yakitrak/obsidian-cli"
cask "1password-cli"
cask "steipete/tap/codexbar"
cask "vlc"
uv "nano-pdf"
