tap "openhue/cli"
tap "steipete/tap"
tap "teamookla/speedtest"
tap "yakitrak/yakitrak"

# --- CLI tools ---
brew "aria2"
brew "bash"
brew "curl"
brew "czkawka"
brew "docker"
brew "emacs"
brew "evernote-backup"
brew "exiftool"
brew "freetds"
brew "gemini-cli"
brew "gh"
brew "git-filter-repo"
brew "glances"
brew "go"
brew "handbrake"
brew "htop"
brew "httpie"
brew "libdvdcss"
brew "libmagic"
brew "libpq"
brew "libzip"
brew "mas"
brew "ncftp"
brew "nmap"
brew "node"
brew "php"
brew "pipx"
brew "poppler"
brew "python@3.13"
brew "python@3.14"
brew "rsync"
brew "testdisk"
brew "tree"
brew "wget"
brew "xorriso"
brew "zstd"
brew "openhue/cli/openhue-cli"
brew "steipete/tap/gogcli"
brew "steipete/tap/goplaces"
brew "steipete/tap/imsg"
brew "steipete/tap/peekaboo"
brew "steipete/tap/songsee"
brew "steipete/tap/summarize"
brew "teamookla/speedtest/speedtest"
brew "yakitrak/yakitrak/obsidian-cli"

# --- GUI apps (casks) ---
cask "1password"
cask "1password-cli"
cask "chatgpt"
cask "claude"
cask "cursor"
cask "docker"
cask "dropbox"
cask "garmin-express"
cask "google-chrome"
cask "iterm2"
cask "makemkv"
cask "microsoft-teams"
cask "obsidian"
cask "openvpn-connect"
cask "postman"
cask "slack"
cask "spotify"
cask "synology-drive"
cask "tailscale"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "steipete/tap/codexbar"

# --- App Store apps (requires: brew "mas") ---
mas "1Password for Safari",          id: 1569813296
mas "Blackmagic Disk Speed Test",    id: 425264550
mas "Deliveries",                    id: 290986013
mas "Double Shot",                   id: 1076145960
mas "Evernote",                      id: 406056744
mas "Final Cut Pro",                 id: 424389933
mas "GoPro Player",                  id: 1460836908
mas "GoPro Quik",                    id: 561350520
mas "iMovie",                        id: 408981434
mas "Keynote",                       id: 361285480
mas "Numbers",                       id: 361304891
mas "Pages",                         id: 361309726
mas "reMarkable",                    id: 1276493162
mas "Simple Refresh",                id: 1492951704
mas "Things 3",                      id: 904280696
mas "ViaTrumfBonusvarsler",          id: 1482280932
mas "WhatsApp",                      id: 310633997
mas "Wipr",                          id: 1662217862
mas "Xcode",                         id: 497799835

# --- Manual installs (not available via brew or App Store) ---
# - Monitor Center
# - myAudi
# - PhoneExpander
# - Recording
# - Reolink
# - Synology Surveillance Station Client
# - Zaptec

uv "nano-pdf"
